#+PROPERTY: header-args :tangle yes

The bottom of init.el pulls in this file via `org-babel-load-file`
Or eval: (org-babel-load-file "~/.emacs.d/config.org" nil)

You can `:tangle on` or `off` to select.

Based off Daniel Mai's config

Instant Reloader:
#+begin_src emacs-lisp
(global-set-key (kbd "C-c i") (lambda() (interactive)(org-babel-load-file "~/.emacs.d/config.org")))
#+end_src

** LSP
;; See lsp-start-plain.el for their canonical test case.

Also before loading languages.
#+begin_src emacs-lisp
  (use-package lsp-mode
    :ensure t
    :hook ((c-mode          ; clangd
            python-mode     ; pyright
            rustic-mode
            ) . lsp-deferred)
    :commands lsp
    :config
    (setq lsp-auto-guess-root t)
    (setq lsp-log-io nil)
    (setq lsp-restart 'auto-restart)
    (setq lsp-enable-symbol-highlighting t)
    (setq lsp-enable-on-type-formatting nil)
    (setq lsp-signature-auto-activate t)
    (setq lsp-signature-render-documentation t)
    (setq lsp-eldoc-hook nil)
    (setq lsp-modeline-code-actions-enable t)
    (setq lsp-modeline-diagnostics-enable t)
    (setq lsp-headerline-breadcrumb-enable t)
    (setq lsp-semantic-tokens-enable t)
    (setq lsp-enable-folding t)
    (setq lsp-enable-imenu t)
    (setq lsp-enable-snippet t)
    (setq read-process-output-max (* 1024 1024)) ;; 1MB
    (setq lsp-idle-delay 0.5))

    ;; (use-package lsp-ui
    ;;   :ensure t
    ;;   :demand t
    ;;   :config
    ;;   (setq lsp-ui-flycheck-enable t)
    ;;   (define-key lsp-ui-mode-map [remap xref-find-definitions] #'lsp-ui-peek-find-definitions)
    ;;   (define-key lsp-ui-mode-map [remap xref-find-references] #'lsp-ui-peek-find-references)
    ;;   :hook 
    ;;   (lsp-mode . lsp-ui-mode))

  (use-package lsp-ui
    :ensure t)

  (use-package yasnippet
    :ensure t
    :init (yas-global-mode))

  (use-package helm-lsp
    :ensure t)

  (use-package dap-mode
    :ensure t)

  (use-package lsp-origami
    :ensure t)

  (use-package company
    :ensure t)

  (use-package lsp-pyright
    :ensure t)

  (add-hook 'prog-mode-hook 'lsp)
#+end_src

#+RESULTS:
| lsp | git-gutter-mode |

